# Використовуємо офіційний образ Node.js версії 18 як базовий шар
FROM node:18

# Встановлюємо робочу директорію всередині контейнера, де буде лежати код
WORKDIR /app

# Копіюємо файли конфігурації залежностей у контейнер
COPY package*.json ./

# Запускаємо встановлення всіх бібліотек, прописаних у package.json
RUN npm install

# Копіюємо всі інші файли проєкту з поточного каталогу в контейнер
COPY . .

# Вказуємо порт 3000
EXPOSE 3000

# Головна команда, яка запустить сервер при старті контейнера
CMD ["npm", "start"]